app/views/restaurants/show.html.erb

    <h2>Menu Items</h2>
    <% @restaurant.menu_items.each do |menu_item| %>
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = ?  [["restaurant_id", 3]]

    <h2>Orders</h2>
    <% @restaurant.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."restaurant_id" = ?  [["restaurant_id", 1]]

    <% end %>
    <h5>Total: <%= @restaurant.orders.sum(:cost) %></h5>
---
SELECT SUM("orders"."cost") FROM "orders" WHERE "orders"."restaurant_id" = ?  [["restaurant_id", 1]]