app/controllers/menu_items_controller.rb

	def create
     @restaurant = Restaurant.find(params[:restaurant_id])
     @menu_item = @restaurant.menu_items.create(menu_item_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "menu_items" ("restaurant_id", "item", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["restaurant_id", 3], ["item", "aadgkjh"], ["cost", #<BigDecimal:7fd454214370,'0.0',9(9)>], ["created_at", 2016-08-16 09:51:14 UTC], ["updated_at", 2016-08-16 09:51:14 UTC]]

    def destroy
	  @restaurant = Restaurant.find(params[:restaurant_id])
	  @menu_item = @restaurant.menu_items.find(params[:id])
	  @menu_item.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = ? AND "menu_items"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 2], ["LIMIT", 1]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = ?  [["id", 2]]