app/controllers/orders_controller.rb

  def create
   @restaurant = Restaurant.find(params[:restaurant_id])
   @order = @restaurant.orders.create(order_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("restaurant_id", "name", "item", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["restaurant_id", 1], ["name", "asglkjb"], ["item", "agkj"], ["cost", #<BigDecimal:7fd452ab9b80,'0.0',9(9)>], ["created_at", 2016-08-17 21:31:12 UTC], ["updated_at", 2016-08-17 21:31:12 UTC]]

  def destroy
    @restaurant = Restaurant.find(params[:restaurant_id])
    @order = @restaurant.orders.find(params[:id])
    @order.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."restaurant_id" = ? AND "orders"."id" = ? LIMIT ?  [["restaurant_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 1]]