app/controllers/restaurants_controller.rb

  def show
    @menu_items = MenuItem.all
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."restaurant_id" = ?  [["restaurant_id", 3]]

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("name", "address", "website", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Connor Johnston"], ["address", "7832 Lakeshore"], ["website", "hgd"], ["phone", "8104883006"], ["created_at", 2016-08-15 11:33:52 UTC], ["updated_at", 2016-08-15 11:33:52 UTC]]

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "address" = ?, "website" = ?, "phone" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["address", "1212 Willard Street"], ["website", "connorjohnston.co"], ["phone", "8104883006"], ["updated_at", 2016-08-18 08:09:34 UTC], ["id", 1]]